import joblib
import os
import pandas as pd

# МЕТРИКИ ДЛЯ ВЕСОВ (R2 Test из таблицы, нормализованные до 100%)
r2_test_values = {
    "Linear Regression": 2,
    "Random Forest": 3.5,
    "CatBoost": 4.5
}

# Нормализация весов до 100% на основе R2 Test
total_r2 = sum(r2_test_values.values())
model_weights = {model: (score / total_r2) * 100 for model, score in r2_test_values.items()}

def load_models(save_path="saved_models"):
    """Загружает три сохраненные модели (каждая - Pipeline)."""
    models = {}
    try:
        models["Linear Regression"] = joblib.load(os.path.join(save_path, "Linear_Regression.pkl"))
        models["Random Forest"] = joblib.load(os.path.join(save_path, "Random_Forest.pkl"))
        models["CatBoost"] = joblib.load(os.path.join(save_path, "CatBoost.pkl"))
    except FileNotFoundError as e:
        return None, f"Не удалось найти модели в папке {save_path}: {e}"
    return models, None

# Справочники для выбора категориальных значений
def get_category_data():
    # Страны для выбора
    country_data = [
        ("AU", "Австралия"), ("AT", "Австрия"), ("AZ", "Азербайджан"), ("AL", "Албания"),
        ("DZ", "Алжир"), ("AI", "Ангилья о. (GB)"), ("AO", "Ангола"), ("AD", "Андорра"),
        ("AQ", "Антарктика"), ("AG", "Антигуа и Барбуда"), ("AN", "Антильские о‐ва (NL)"),
        ("AR", "Аргентина"), ("AM", "Армения"), ("AW", "Аруба"), ("AF", "Афганистан"),
        ("BS", "Багамы"), ("BD", "Бангладеш"), ("BB", "Барбадос"), ("BH", "Бахрейн"),
        ("BY", "Беларусь"), ("BZ", "Белиз"), ("BE", "Бельгия"), ("BJ", "Бенин"),
        ("BM", "Бермуды"), ("BV", "Бове о. (NO)"), ("BG", "Болгария"), ("BO", "Боливия"),
        ("BA", "Босния и Герцеговина"), ("BW", "Ботсвана"), ("BR", "Бразилия"), ("BN", "Бруней Дарассалам"),
        ("BF", "Буркина‐Фасо"), ("BI", "Бурунди"), ("BT", "Бутан"), ("VU", "Вануату"),
        ("VA", "Ватикан"), ("GB", "Великобритания"), ("HU", "Венгрия"), ("VE", "Венесуэла"),
        ("VG", "Виргинские о‐ва (GB)"), ("VI", "Виргинские о‐ва (US)"), ("AS", "Восточное Самоа (US)"),
        ("TP", "Восточный Тимор"), ("VN", "Вьетнам"), ("GA", "Габон"), ("HT", "Гаити"),
        ("GY", "Гайана"), ("GM", "Гамбия"), ("GH", "Гана"), ("GP", "Гваделупа"),
        ("GT", "Гватемала"), ("GN", "Гвинея"), ("GW", "Гвинея‐Бисау"), ("DE", "Германия"),
        ("GI", "Гибралтар"), ("HN", "Гондурас"), ("HK", "Гонконг (CN)"), ("GD", "Гренада"),
        ("GL", "Гренландия (DK)"), ("GR", "Греция"), ("GE", "Грузия"), ("GU", "Гуам"),
        ("DK", "Дания"), ("CD", "Демократическая Республика Конго"), ("DJ", "Джибути"),
        ("DM", "Доминика"), ("DO", "Доминиканская Республика"), ("EG", "Египет"), ("ZM", "Замбия"),
        ("EH", "Западная Сахара"), ("ZW", "Зимбабве"), ("IL", "Израиль"), ("IN", "Индия"),
        ("ID", "Индонезия"), ("JO", "Иордания"), ("IQ", "Ирак"), ("IR", "Иран"),
        ("IE", "Ирландия"), ("IS", "Исландия"), ("ES", "Испания"), ("IT", "Италия"),
        ("YE", "Йемен"), ("CV", "Кабо‐Верде"), ("KZ", "Казахстан"), ("KY", "Каймановы о‐ва (GB)"),
        ("KH", "Камбоджа"), ("CM", "Камерун"), ("CA", "Канада"), ("QA", "Катар"),
        ("KE", "Кения"), ("CY", "Кипр"), ("KG", "Киргизстан"), ("KI", "Кирибати"),
        ("CN", "Китай"), ("CC", "Кокосовые (Киилинг) о‐ва (AU)"), ("CO", "Колумбия"),
        ("KM", "Коморские о‐ва"), ("CG", "Конго"), ("CR", "Коста‐Рика"), ("CI", "Кот‐д'Ивуар"),
        ("CU", "Куба"), ("KW", "Кувейт"), ("CK", "Кука о‐ва (NZ)"), ("LA", "Лаос"),
        ("LV", "Латвия"), ("LS", "Лесото"), ("LR", "Либерия"), ("LB", "Ливан"),
        ("LY", "Ливия"), ("LT", "Литва"), ("LI", "Лихтенштейн"), ("LU", "Люксембург"),
        ("MU", "Маврикий"), ("MR", "Мавритания"), ("MG", "Мадагаскар"), ("YT", "Майотта о. (KM)"),
        ("MO", "Макао (PT)"), ("MK", "Македония"), ("MW", "Малави"), ("MY", "Малайзия"),
        ("ML", "Мали"), ("MV", "Мальдивы"), ("MT", "Мальта"), ("MA", "Марокко"),
        ("MQ", "Мартиника"), ("MH", "Маршалловы о‐ва"), ("MX", "Мексика"), ("FM", "Микронезия (US)"),
        ("MZ", "Мозамбик"), ("MD", "Молдова"), ("MC", "Монако"), ("MN", "Монголия"),
        ("MS", "Монсеррат о. (GB)"), ("MM", "Мьянма"), ("NA", "Намибия"), ("NR", "Науру"),
        ("NP", "Непал"), ("NE", "Нигер"), ("NG", "Нигерия"), ("NL", "Нидерланды"),
        ("NI", "Никарагуа"), ("NU", "Ниуэ о. (NZ)"), ("NZ", "Новая Зеландия"), ("NC", "Новая Каледония о. (FR)"),
        ("NO", "Норвегия"), ("NF", "Норфолк о. (AU)"), ("AE", "Объединенные Арабские Эмираты"),
        ("OM", "Оман"), ("PK", "Пакистан"), ("PW", "Палау (US)"), ("PS", "Палестинская автономия"),
        ("PA", "Панама"), ("PG", "Папуа‐Новая Гвинея"), ("PY", "Парагвай"), ("PE", "Перу"),
        ("PN", "Питкэрн о‐ва (GB)"), ("PL", "Польша"), ("PT", "Португалия"), ("PR", "Пуэрто‐Рико (US)"),
        ("RE", "Реюньон о. (FR)"), ("CX", "Рождества о. (AU)"), ("RU", "Россия"), ("RW", "Руанда"),
        ("RO", "Румыния"), ("SV", "Сальвадор"), ("WS", "Самоа"), ("SM", "Сан Марино"),
        ("ST", "Сан‐Томе и Принсипи"), ("SA", "Саудовская Аравия"), ("SZ", "Свазиленд"),
        ("SJ", "Свалбард и Ян Мейен о‐ва (NO)"), ("SH", "Святой Елены о. (GB)"), ("KP", "Северная Корея (КНДР)"),
        ("MP", "Северные Марианские"), ("SC", "Сейшелы"), ("VC", "Сен‐Винсент и Гренадины"),
        ("PM", "Сен‐Пьер и Микелон (FR)"), ("SN", "Сенегал"), ("KN", "Сент‐Кристофер и Невис"),
        ("LC", "Сент‐Люсия"), ("SG", "Сингапур"), ("SY", "Сирия"), ("SK", "Словакия"),
        ("SI", "Словения"), ("US", "Соединенные Штаты Америки"), ("SB", "Соломоновы о‐ва"),
        ("SO", "Сомали"), ("SD", "Судан"), ("SR", "Суринам"), ("SL", "Сьерра‐Леоне"),
        ("TJ", "Таджикистан"), ("TH", "Таиланд"), ("TW", "Тайвань"), ("TZ", "Танзания"),
        ("TC", "Теркс и Кайкос о‐ва (GB)"), ("TG", "Того"), ("TK", "Токелау о‐ва (NZ)"),
        ("TO", "Тонга"), ("TT", "Тринидад и Тобаго"), ("TV", "Тувалу"), ("TN", "Тунис"),
        ("TM", "Туркменистан"), ("TR", "Турция"), ("UG", "Уганда"), ("UZ", "Узбекистан"),
        ("UA", "Украина"), ("WF", "Уоллис и Футунао‐ва (FR)"), ("UY", "Уругвай"),
        ("FO", "Фарерские о‐ва (DK)"), ("FJ", "Фиджи"), ("PH", "Филиппины"), ("FI", "Финляндия"),
        ("FK", "Фолклендские (Мальвинские) о‐ва (GB/AR)"), ("FR", "Франция"), ("GF", "Французская Гвиана (FR)"),
        ("PF", "Французская Полинезия"), ("HM", "Херд и Макдональд о‐ва (AU)"), ("HR", "Хорватия"),
        ("CF", "Центрально‐африканская Республика"), ("TD", "Чад"), ("CZ", "Чехия"), ("CL", "Чили"),
        ("CH", "Швейцария"), ("SE", "Швеция"), ("LK", "Шри‐Ланка"), ("EC", "Эквадор"),
        ("GQ", "Экваториальная Гвинея"), ("ER", "Эритрия"), ("EE", "Эстония"), ("ET", "Эфиопия"),
        ("YU", "Югославия"), ("ZA", "Южная Африка"), ("GS", "Южная Георгия и Южные Сандвичевы о‐ва"),
        ("KR", "Южная Корея (Республика Корея)"), ("JM", "Ямайка"), ("JP", "Япония"),
        ("TF", "Французские южные территории (FR)"), ("IO", "Британская территория Индийского океана (GB)"),
        ("UM", "Соединенные Штаты Америки Внешние малые острова (US)")
    ]
    
    country_dict = dict(country_data)
    reverse_country_dict = {v: k for k, v in country_dict.items()}

    # Другие категории
    experience_level_data = [("EN", "Начальный"), ("MI", "Средний"), ("SE", "Старший"), ("EX", "Эксперт")]
    employment_type_data = [("FT", "Полная занятость"), ("CT", "Контрактная занятость"), ("FL", "Фриланс"), ("PT", "Частичная занятость")]
    company_size_data = [("S", "Маленькая компания"), ("M", "Средняя компания"), ("L", "Большая компания")]
    salary_currency_data = [('EUR', 'Евро'), ('USD', 'Доллар США'), ('INR', 'Индийская рупия'), ('JPY', 'Японская иена')]

    # Преобразуем в словари
    experience_level_dict = dict(experience_level_data)
    employment_type_dict = dict(employment_type_data)
    company_size_dict = dict(company_size_data)
    salary_currency_dict = dict(salary_currency_data)

    return reverse_country_dict, country_dict, experience_level_dict, employment_type_dict, company_size_dict, salary_currency_dict
